#### Generic Members

---

|  |
| --- |
| Generic Class   Properties   See Also |

The  Generic  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ColorByObject | The property labeled "Color By Object" from the "Generic" schema. |
| Public property Static member | CommonTintColor | The property labeled "Tint Color" from the "Generic" schema. |
| Public property Static member | CommonTintToggle | The property labeled "Tint" from the "Generic" schema. |
| Public property Static member | GenericBumpAmount | The property labeled "Amount" from the "Generic" schema. |
| Public property Static member | GenericBumpMap | The property labeled "Bump" from the "Generic" schema. |
| Public property Static member | GenericCutoutOpacity | The property labeled "Cutouts" from the "Generic" schema. |
| Public property Static member | GenericDiffuse | The property labeled "Color/Image" from the "Generic" schema. |
| Public property Static member | GenericDiffuseImageFade | The property labeled "Image Fade" from the "Generic" schema. |
| Public property Static member | GenericGlossiness | The property labeled "Glossiness" from the "Generic" schema. |
| Public property Static member | GenericIsMetal | The property labeled "Highlights" from the "Generic" schema. |
| Public property Static member | GenericReflectivityAt0deg | The property labeled "Reflectivity/Direct" from the "Generic" schema. |
| Public property Static member | GenericReflectivityAt90deg | The property labeled "Reflectivity/Oblique" from the "Generic" schema. |
| Public property Static member | GenericRefractionIndex | The property labeled "Refraction" from the "Generic" schema. |
| Public property Static member | GenericRefractionTranslucencyWeight | The property labeled "Translucency" from the "Generic" schema. |
| Public property Static member | GenericSelfIllumColorTemperature | The property labeled "Color Temperature" from the "Generic" schema. |
| Public property Static member | GenericSelfIllumFilterMap | The property labeled "Filter Color" from the "Generic" schema. |
| Public property Static member | GenericSelfIllumLuminance | The property labeled "Luminance" from the "Generic" schema. |
| Public property Static member | GenericTransparency | The property labeled "Transparency" from the "Generic" schema. |
| Public property Static member | GenericTransparencyImageFade | The property labeled "Image Fade" from the "Generic" schema. |

# See Also

Generic Class

Autodesk.Revit.DB.Visual Namespace